БухЭксп/Catalogs/CW_РеестрыНДС0ЗаписиРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РеестрыНДС0ЗаписиРеестра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеПриложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПриложенияТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0СтатусыЗаписиРеестра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПриказа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_РеестрыНДС0ЗаписиРеестра/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Параметры.Свойство("ДокументРеализации", ДокументРеализации);     
	Элементы.ДокументРеализацииОтбор.Видимость = ЗначениеЗаполнено(ДокументРеализации);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
//	CW_РеестрыНДС0Клиент.СписокПередНачаломДобавления(ЭтаФорма,Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьРеквизитыОбъектов(Команда)     
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	МассивРеквизитов = Новый Массив;
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"ПериодОтчета");
	ДанныеРеквизита.Вставить("Заголовок", 	"Период отчета");
	ДанныеРеквизита.Вставить("Значение", 	НачалоКвартала(ТекущаяДата()));

	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"ПодтверждениеНДС");
	ДанныеРеквизита.Вставить("Заголовок", 	"Подтверждение НДС");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0СтатусыЗаписиРеестра.ПустаяСсылка"));

	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Организация");
	ДанныеРеквизита.Вставить("Заголовок", 	"Организация");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")); 
	
	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
 	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Заблокирован");
	ДанныеРеквизита.Вставить("Заголовок", 	"Заблокирован");
	ДанныеРеквизита.Вставить("Значение", 	Ложь);

	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("РедактируемыеРеквизиты", МассивРеквизитов); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);	
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.Форма.ФормаГрупповогоИзмененияРеквизитов", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьРедактированиеРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылки", 				ДополнительныеПараметры.ВыделенныеСтроки); 
	ПараметрыПроцедуры.Вставить("ЗначенияРеквизитов",	РезультатВыбора);
	
	РезультатВыполнения =  НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФоновоеРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры    

&НаСервере
Функция НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Редактирование реквизитов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_РеестрыНДС0ЗаписиРеестра.ВыполнитьИзменениеРеквитовОбъетов", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ЗавершитьФоновоеРедактированиеРеквизитов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_РеестрыНДС0ЗаписиРеестра"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось изменить реквизты!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка изменения реквизитов");
	КонецЕсли;
	
КонецПроцедуры
